# slice
# sequence[start:stop:step]
# 可索引的数据类型都支持切片操作，包括字符串、列表、元组等
# 切片不改变原有的数据，而是返回一个新的数据，且不改变类型

x = tuple(range(10))
print(x[:]) # (0, 1, 2, 3, 4, 5, 6, 7, 8, 9)
print(x[1:]) # (1, 2, 3, 4, 5, 6, 7, 8, 9)
print(x[:-1]) # (0, 1, 2, 3, 4, 5, 6, 7, 8)
print(x[::2]) # (0, 2, 4, 6, 8)
print(x[1:5]) # (1, 2, 3, 4)

print(x[-1:-10:-1]) # (9, 8, 7, 6, 5, 4, 3, 2, 1)
print(x[8::-3]) # (8, 5, 2)

# 探寻切片的本质
# 切后是浅拷贝
# 所以切片的使用会占用更多的内存
x = [1, 2, 3, 4, 5]
y = x[:]
print(1, x is y) # False，切片操作返回的是一个新的对象

